package cn.whuerbbs.backend.common;

public class AnonymousNameConstants {
    public static final String[] ANONYMOUS_NAME_LIST = new String[]{
            "东湖村摸鱼仔",
            "奥场小情侣",
            "东湖村摸鱼仔",
            "奥场小情侣",
            "桂园食堂大妈",
            "湖滨钓鱼大爷",
            "信部彭于晏",
            "星湖鸭子",
            "枫园夜猫子",
            "工学部蔡徐坤",
            "工学部大盘鸡",
            "情人坡单身狗",
            "烤冷面摊主",
            "珞珈山已挂野猪",
            "珞珈山小狐狸",
            "武大果酱选手",
            "高数高分玩家",
            "梅园石楠花",
            "相声特长生",
            "此人已辍学",
            "校长亲弟弟",
            "东湖龙舟队员",
            "单车冲坡高手",
            "留级老学长",
            "新传小姐姐",
            "生科科研狗",
            "艺术系校花",
            "医村小学妹",
            "经管满绩女孩",
            "路边测绘组合",
            "计院小码农",
            "物院一枝花"
    };
}
