package cn.whuerbbs.backend.common;

import java.util.List;

public final class SchoolConstants {
    public static final List<String> SCHOOL_LIST = List.of(
            "哲学学院",
            "国学院",
            "历史学院",
            "文学院",
            "新闻与传播学院",
            "艺术学院",
            "外国语言文学院",
            "马克思主义学院",
            "信息管理学院",
            "政治与公共管理学院",
            "经济与管理学院",
            "社会学系",
            "法学院",
            "教育科学研究院",
            "数学与统计学院",
            "物理科学与技术学院",
            "化学与分子科学学院",
            "生命科学学院",
            "资源与环境科学学院",
            "高等研究院",
            "土木建筑工程学院",
            "电气与自动化学院",
            "城市设计学院",
            "动力与机械学院",
            "水利水电学院",
            "工业科学研究院",
            "电子信息学院",
            "计算机学院",
            "测绘学院",
            "遥感信息工程学院",
            "印刷与包装系",
            "国家网络安全学院",
            "第一临床学院",
            "第二临床学院",
            "口腔医学院",
            "健康学院",
            "药学院",
            "医学部机关",
            "医学研究院",
            "基础医学院",
            "医学职业技术学院",
            "弘毅学堂",
            "其他"
    );

    public static final List<String> GRADE_LIST = List.of(
            "2011级",
            "2012级",
            "2013级",
            "2014级",
            "2015级",
            "2016级",
            "2017级",
            "2018级",
            "2019级",
            "杰出校友",
            "不告诉你"
    );

    public static final List<String> DIPLOMA_LIST = List.of(
            "本科",
            "硕士",
            "博士",
            "博士后"
    );
}
